Revit 2027 API
RebarSplice.SpliceTypeId Property
 Identifies the id of the Rebar Splice Type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SpliceTypeId { get; set; }
Public Property SpliceTypeId As ElementId
	Get
	Set
public:
property ElementId^ SpliceTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member SpliceTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The provided id doesn't represent a valid Rebar Splice Type.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Interactions with Rebar Splice Types can be done with the functions in RebarSpliceTypeUtils.
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace